[
	"Why were so many niggers killed in the Vietnam war? \n Because when the sergeant said to get down, they all got up and started dancing.",
	"What did God say when he made the first niggers? \n Oops! Burnt another one!",
	"A Mexican and a nigger are riding in car . . whos driving?  \n A cop!",
	"What happens when you stick your hand in a jar of jelly beans? \n The black ones steal your watch and rings.",
	"What do you call a smiling black man? \n Snigger",
	"Whats black and white and rolls down the Boardwalk? \n A nigger and a seagull fighting over a French Fry.",
	"What do black men do after sex? \n 15 years to life.",
	"Did you hear about the 9 year old African nigglet? \n He was going through a mid-life crisis.",
	"What do you call a nigger in a tree with a briefcase? \n Branch manager.",
	"How do you stop a nigger from drowning? \n Take your foot off the back of his head.",
	"How do you get a nigger out of a tree? \n Cut the rope.",
	"Why do niggers stink? \n So blind people can hate them too.",
	"What's the worst thing you can call a black man, starting with N and ending with R? \n Neighbor",
	"What's the difference between a nigger and a letter? \n You can send the letter back where it came from!",
	"What would you call the Flintstones if they were black? \n Niggers",
	"What does a nigger and sperm have in common? \n Only about 1 out of two million actually work",
	"What do a slinky and a nigger have in common? \n Both are useless but it's fun to watch them falling down the stairs",
	"How do you know Adam and Eve were not black? \nYou ever try to take a rib from a nigger?",
	"What is a nigger?\nProof that skunks fuck monkeys.",
	"Whats the difference between a dead dog in the road and a dead nigger in the road?\nThe dead dog has skid marks in front of it.",
	"What did Abe Lincoln say after a 3 day drunk?\nI set WHO free?",
	"What do you call a nigger with a peg leg?\nShit on a stick",
	"I like black people . . .\n. . I used to have some black friends till my dad sold them!",
	"What does a nigress and an ice hockey player have in common?\nThey both change their pads after 3 periods",
	"Why do blacks have white hands and feet?\nThey were on all fours when God spray painted them!",
	"Why do black people have white hands?\nThey were up against the wall when God spray painted them!",
	"Why do black people have white hands?\nEveryone has some good in them!",
	"Why do black people have white hands?\nIt rubs off the cop cars",
	"Why do more niggers get hit by cars in the winter?\nTheyre easier to spot!",
	"What do you call two blacks on one bike?\nOrganized crime!",
	"Why are niggers getting stronger?\nT.V.s are getting bigger!",
	"What happened to the nigger who had an abortion?\nCrime Stoppers sent her a check for $500!",
	"Why dont nigger bitchs wear panties to picnics?\nTo keep the flies away from the chicken!",
	"Whats the difference between a truck full of baby niggers and a truck full of bowling balls?\nYou cant unload a truck full of bowling balls with a pitchfork!",
	"What does FUBU stand for?\nFarmers Used to Buy Us", "What does FUBU stand for?\nFarmers Used to Beat Us",
	"Why dont sharks eat niggers?\nThey think its whale shit!",
	"Why do niggers call white people honkies?\nThats the last sound they hear before they get hit!",
	"What do they do with dead niggers in California?\nGut them to make wetsuits!",
	"Why does L.A. have so many fags and N.Y. so many niggers?\nL.A. had first choice!",
	"What do you call a chinese nigger with AIDS?\nCoon Die Soon",
	"What does NAACP stand for?\nNiggers Against All Caucasian People",
	"What does NAACP stand for?\nNow Apes Are Called People",
	"Why are all the niggers fast runners?\nAll the slow ones are in jail.",
	"Whats the difference between niggers and snow tires?\nSnow tires dont sing when you put chains on them!",
	"How do you keep a nigger from going out?\nPour more gas on him!",
	"Why do white folks go to nigger garage sales?\nTo get their stuff back.",
	"How do you keep niggers out of your back yard?\nHang one in your front yard!",
	"What does a nigger and sperm have in common?\nOnly about 1 out of two million actually work.",
	"What do you do if you wake up in the middle of the night to see your television floating in mid-air?\nShoot the nigger stealing it.",
	"Whats the difference between a large pizza and a nigger?\nA pizza can feed a family of four.",
	"Whats wrong with four niggers in a cadillac going off a cliff?\nA cadillac seats five!",
	"How can you tell a niggers just had sex?\nHis eyes are all red from the mace.",
	"How do you get a nigger to leave you alone?\nThrow him a basketball!",
	"Whats the difference between a naked white woman and a naked black woman?\nOnes on the cover of Playboy and the others on the cover of National Geographic.",
	"Why dont niggers dream?\nThe last one to have a dream got shot.",
	"Theres an American airline and one of the engines is going out so they decide they need to get rid of some weight or they will crash. To do it fairly they decide to do it in alphabetical order. So they tell all of the African Americans to jump off the plane, no one moves. So they say, Okay, all the blacks jump off. Still no one jumps. So they say, All of the colored people jump off. Still no one jumps. Finally this little kid walks up to his dad and says, Daddy, arent we all three of those? And the dad says, Nope, today were NIGGERS, we aint jumpin before the MEXICANS.",
	"A nigger and a spic fall from a tree, who hits the ground first?\nThe spic, the nigger never makes it because hes stopped by the rope.",
	"There was a blackout in my neighborhood last night.\nI had to shoot him before he stole everything.",
	"What would Martin Luther King, Jr be if he was white?\nAlive!",
	"A Nigger runs into a doctors office and says, Doctor, Doctor I cant stop running around! The doctor says, Okay, take this tablet. The Nigger slows down and stops. He said, WOW! It really worked! Ive tried everything! What was it? The doctor says, Its Persil - Stops colours running.",
	"Whats the most confusing day in Harlem?\nFathers Day!",
	"Why do niggers have white palms?\nTheres a little good in everyone.",
	"People keep saying that Americans are stupid, but I disagree. Anyone that builds a city 10 meters below sea level, in a hurricane zone, and fills it with niggers is a fucking genius!",
	"Why do more niggers get hit by cars in the winter?\nTheyre easier to spot!",
	"I like black people . . .\n. . I used to have some black friends till my dad sold them!",
	"What did the nigger get on his SATs?\nBarbecue sauce!",
	"Why dont niggers like blow jobs?\nNiggers dont like ANY jobs!",
	"Whats the difference between a Ferrari and a pile of dead niggers?\nI dont have a Ferrari in my garage",
	"What was missing from the Million Man March?\nAbout a thousand miles of chain and an auctioneer!",
	"Why did the nigger cross the road?\nI tugged his neck-chain in that direction.",
	"Why does L.A. have so many gays and N.Y. so many niggers?\nL.A. had first choice",
	"Why was the nigger with diarrea freaking out?\nHe thought he was melting!",
	"Why cant Ray Charles or Stevie Wonder read?\nTheyre niggers!",
	"What did Lincoln say after a three day drinking binge?\nI freed WHO?",
	"Why are apes always frowning?\nThey heard that in a million years theyll be niggers!",
	"Did you know Oprah and Stevie Wonder both had the same nick name in school?\nIt was nigger",
	"What would you do if you had enough money to send half the niggers back to africa?\nSend them all back - half way",
	"Why do people hit things when they dont work?\nIt worked with the slaves",
	"What do Nike and the KKK have in common?\nThey both make niggers run faster",
	"Whats the difference between a nigger and a bouncy castle?\nYou dont take your shoes off to jump on a nigger!",
	"Did you hear about KuKluxKnevials latest stunt?\nHe tried to jump 50 niggers with a steam roller.",
	"An africoon nigger goes to the doctor and says, I feel terrible.\nDoctor says, go home, get a bucket, piss and shit in it for a week. Throw in dead rats and rotting fish. Put a towel over your head and sniff the fumes for three days.\nWeek later nigger goes back and says, Doc, I feel wonderful, what was the problem?\nDoctor, you were homesick!",
	"Englishman applies for a job with South African police. Inspector says These are the best qualifications Ive ever seen, just one test before you get the job. Take this gun, go out and shoot six niggers and a rabbit.\nBloke replies Why the rabbit?\nInspector says Fantastic attitude, youve got the job!",
	"In a recent survey, people from Detroit have proved to be the most likely to have had sex in the shower. In the survey, carried out for a leading toiletries outfit, 86% of Detroit residents said that they have had, if not enjoyed, sex in the shower.\nThe other 14% said they havent yet served any time in prison.",
	"What's the difference between dog shit and niggers?\nWhen dog shit gets old it turns White and quits stinking.",
	"What's the difference between a jew and a pizza?\nA pizza doesn't scream in the oven.",
	"What's the difference between a nigger and a snow tire?\nA snow tire doesn't sing when you put chains on it.",
	"What would you call the Flintstones if they were black?\nNiggers.",
	"Why don't sharks eat niggers?\nThey think it's whale shit.",
	"What do you call a nigger in a tree with a briefcase?\nBranch manager.",
	"How come there aren't any Mexicans on Star Trek?\nThey don't work in the future, either.",
	"How do you stop a nigger from drowning?\nTake your foot off the back of his head.",
	"How do you get a nigger out of a tree?\nCut the rope.",
	"What did the Alabama sherriff call the nigger who had been shot 15 times?\nWorst case of suicide he had ever seen.",
	"What do you get when you cross a retard with a gang banger?\nSomeone who spray paints on a chain link fence.",
	"Why do niggers stink?\nSo blind people can hate them too.",
	"What do you get when you cross a nigger and a spic?\nSomeone too lazy to steal.",
	"Why don't niggers take aspirin?\nThey refuse to pick the cotton out.",
	"What do nigger kids get for Christmas?\nYour bike.",
	"Why do spics drive low-riders?\nSo they can cruise and pick lettuce at the same time.",
	"What do you get when you cross a jew and a gypsy?\nA chain of empty retail stores.",
	"Why don't nigger kids play in the sandbox?\nCats keep covering them up.",
	"What do you call an apartment full of niggers?\nA COON-dominium.",
	"Why are there no nigger astronauts?\nTheir lips explode at 50,000 feet.",
	"How do you babysit a niglet?\nWet his lips and stick him to the wall.",
	"How do you get him down?\nTeach him to say \"Motherfucker.\"",
	"How else do you babysit a niglet?\nPut Velcro on the ceiling and tell him to jump.\n\nHow do you get him down?\nInvite the spics over, blindfold them and tell them it's a piñata party.",
	"Why do jews have big noses?\nAir is free.", "What is a nigger on a bike?\nThief.",
	"What's long and black and smells like shit?\nThe welfare line.",
	"What do you call 50 niggers at the bottom of the ocean?\nGood start.",
	"What is the worst 3 years of a niggers life?\nFirst grade.",
	"How was break dancing invented?\nNiggers trying to steal hubcaps from moving cars.",
	"Why do niggers keep chickens in their back yards?\nTo teach their kids how to walk.",
	"How do you know Adam and Eve were not black?\nYou ever try to take a rib from a nigger?",
	"What is a nigger?\nProof that skunks fuck monkeys.",
	"What's the difference between a dead dog in the road and a dead nigger in the road?\nThe dead dog has skid marks in front of it.",
	"Why are chimps always frowning?\nThey know in a million years they are going to turn into niggers.",
	"Why is interrogating a Mexican like a pool ball?\nThe harder you hit it the more English you get.",
	"How many jews can you fit in a VolksWagon?\nAll of them if you put them in the ashtray.",
	"A nigger and a spic jump off the Empire State Building, who hits the ground first?\nWho cares.",
	"A nigger and a spic jump off the Empire State Building, who hits the ground first?\nThe spic, because the nigger had to stop on the way down and spray paint \"motherfucker\" on the wall.",
	"Why don't spics have barbeques?\nThe beans keep falling through the grill.",
	"You hear about the new car made in Israel?\nNot only can it stop on a dime, it will go back and pick it up.",
	"What do you call an Ethiopian with a pickle on his head?\nA quarter-pounder.",
	"How many Ethiopians can you fit in a phone booth?\nAll of them.",
	"How do you start a foot race in Ethiopia?\nRoll a doughnut down the street.",
	"How many niggers does it take to pave a driveway?\nOne if you spread him real thin.",
	"How do you blindfold a chink?\nDental floss.",
	"How do chinks name their kids?\nThey throw silverware down the stairs.",
	"What's the difference between a nigger and a bag of shit?\nThe bag.",
	"When does a Black man turn into a nigger?\nAs soon as he leaves the room.",
	"What do you call a nigger with a Harvard education?\nNigger.",
	"What do you call a nigger in a courtroom in a 3 piece suit?\nThe defendant.",
	"There is a nigger and a spic in a car, who's driving?\nThe cop.",
	"Why is Stevie Wonder always smiling?\nHe doesn't know he's black.",
	"How long does it take a nigger bitch to take a shit?\n9 months.",
	"Why don't nigger women wear panties to picnics?\nTo keep the flies off the chicken.",
	"Why does Alabama have niggers and California have earthquakes?\nCalifornia got first pick.",
	"Why do Mexican cars have those little steering wheels?\nSo they can drive handcuffed.",
	"Why are niggers like sperm?\nOnly one in a million actually work.",
	"What do you call Mike Tyson with no arms?\nNiger nigger nigger.",
	"How do you fit 100 Cubans in a shoe box?\nTell them its a raft.",
	"Why do police dogs lick their ass?\nTo get the taste of nigger out of their mouth.",
	"Why did the nigger carry a piece of shit in his wallet?\nI.D.",
	"What is red green yellow orange purple and pink?\nA nigger dressed for church.",
	"Why do niggers have flat noses?\nThat's where god put his feet when he was pulling off their tails.",
	"Did you hear that the KKK bought the movie rights to Roots?\nThey're going to play it backwards so it has a happy ending.",
	"What is the difference between a white owl and a black owl?\nA white owl goes, \"Who, who,\" a black owl goes, \"Who dat? Who dat?\"",
	"Did you hear about the new Black Barbie?\nIt comes with 12 kids, AIDS and a welfare check.",
	"What is black, white, and rolls off the end of the pier?\nA nigger and a seagull fighting over a chicken wing.",
	"What do you get when you cross a nigger with a gorilla?\nA dumb gorilla.",
	"What is the difference between Batman and a black man?\nBatman can go out at night without Robin.",
	"Did you hear about the new Chap Stick for niggers?\nIt comes in a spray can.",
	"What's the difference between niggers and pit-bulls?\nIt's still legal to own a pit-bull.",
	"What do you say to a black man in uniform?\n\"I'll have a Big Mac with cheese and a coke.\"",
	"Why do niggers walk the way they do?\nBecause they spent the first nine months of their lives dodging a coat hanger.",
	"What happened when the Ethiopian fell in the crocodile pit?\nHe ate six crocs before they could pull him out.",
	"How do you stop a nigger from going out?\nPour more gas on him.",
	"Did you hear about the nigger with insomnia?\nHe kept waking up twice a week.",
	"What do you do if you run over a nigger?\nReverse.",
	"Why do decent white folks shop at nigger yard sales?\nTo get all their stuff back.",
	"Who were the three most famous women in black history?\nAunt Jemima, Diana Ross, and Mother Fucker!",
	"What do Stevie Wonder and Ray Charles have in common ? \nThey 're both niggers.",
	"What happened when the nigger looked up his family tree?\nA gorilla shit on his face.",
	"Why don't niggers like blowjobs?\nThey don't like any jobs.",
	"What do you call a nigger priest?\nHoly shit.",
	"Why do niggers put their garbage out in clear plastic bags?\nSo mexicans can window shop.",
	"Why do mexicans buy Cabbage Patch dolls?\nBecause they come with birth certificates.",
	"Why don't mexicans have any Olympic teams?\nBecause all the mexicans who can run, jump, or swim have already left the country.",
	"Why don't mexicans play hide and seek?\nBecause no one will look for them.",
	"Why do mexicans have re-fried beans?\nHave you ever heard of a mexican doing anything right the first time?",
	"How can you tell a mexican airline?\nIt's the one with hair under the wings.",
	"What do you get when you cross a mexican with an octopus?\nI don't know but it sure can pick lettuce.",
	"What are three things you can't give a nigger?\nA black eye, a fat lip and an education.",
	"What do niggers use to wash their white clothes?\nBLEEATCH!",
	"Why can't spics be firefighters?\nThey can't tell Jose from hose B.",
	"What did the nigger say when he slid down the zebra?\nNow you see me, now you don't, now you see me, now you don't.",
	"What is the difference between a pair of jeans and an Ethiopian?\nA pair of jeans only has one fly on it.",
	"What word starts with \"N\" and ends with \"R\" that you never want to call a black person?\nNeighbor.",
	"What do you call two Ethiopians in a gold sleeping bag?\nTwix.",
	"Why is a Spic like a Skunk?\nBeause they're half balck and half white, and smell like shit.",
	"What's the difference between a nigger and a letter?\nYou can send a letter back to where it came from.",
	"What's the difference between the holy grail and a nigger's daddy?\nYou may find the grail.",
	"What is black, runny, and scratches on glass?\nA nigger in a microwave.",
	"What do you call 9 mexicans in front of your house?\nA spicket fence.",
	"How does the navy use niggers?\nThey debone them and use them as wetsuits.",
	"Do you remember the nigger family on the Jetsons? No?\nThe future looks pretty good!",
	"Did you hear about the nigger that thought he was bleeding to death?\nTurns out he just had diarrhea.",
	"Why don't jews like oral sex?\nIt's too close to the gas chamber.",
	"Why don't you run over a nigger on a bike?\nIts probably your bike.",
	"What do you call 50 niggers burried up to their necks in dirt?\nAfro-turf.",
	"Why do niggers drive with their windows up?\nThey think the smell is coming from outside.",
	"Why do niggers eat tootsie rolls with a fork?\nSo they don't bite their fingers.",
	"What do you call two nigger cops on motorcycles?\nChocolate chips.",
	"Why don't niggers celebrate Thanksgiving?\nKFC isn't open on holidays.",
	"Why do niggers like basket ball?\nIt involves running, shooting and stealing.",
	"What has four legs and a black arm?\nA happy pitbull.",
	"How do you know if a nigger is well hung?\nIf you can't fit your finger between his neck and the noose.",
	"How many nigger college students does it take to screw in a lightbulb?\nOnly one, but he gets 6 credits for it."
]